
Skip to end of metadata
Created by Bobby D., last modified on Mar 09, 2021Go to start of metadata
Our mission
Welcome to San Andreas Fire Rescue. We are a team of highly trained individuals that respond to a variety of Fire and EMS related emergencies. We are staffed with members that serve the people of San Andreas at every given moment of time. Our experiences, both in classroom materials and on-scene knowledge, help to keep the people of San Andreas safe and healthy.

Responsibilities
San Andreas Fire Rescue responds to all Fire related calls at any time of the day.  We are able to provide extrication from vehicles and structures, technical rescues, and fire extinguishment. The department also utilizes air apparatus for rapid patient transport and for aerial search and rescue.

Fire/EMS Chief’s Role
The role of the Fire Chief is to oversee all personnel and decisions made for the department as an Admin Member. The Chief will make the overall final decision in department matters such as Policy changes as well as disciplinary decisions. It is the Chief’s role to be the overall leader of the department and the one the members can trust to do their job to the best of their ability. It is the Chief that the members should look to for overall guidance involved in Department operations, and handle more of an oversight over the entire department. They can be easily identified by the White on White Fire helmet and/or a White Button-up Shirt with gold bugles.

Fire/EMS Battalion Chief’s Role
The role of the Battalion Chief is to assist the Chief in making decisions in regards to policy and operations in the department as a Junior Administrative member, being able to give major disciplinary points. They can take command of scenes as well as be a crucial role in overseeing the training of new fire recruits. They are easily identified by a Black on White Fire helmet and/or a White Button-up Shirt with gold bugles.

Fire/EMS Captain’s Role
The role of the Fire/EMS Captain is to complete the role of a Senior Staff member. The Captain will help with implementing Policies and Procedures of the department as well as be a crucial role in the day-to-day operations by taking command of scenes and giving input on new policies for the department. The Captain should be someone that the members of the department can look to for guidance and leadership in scenes and in dealing with issues in- and out- of-game. They can be easily identified by having silver bugles as well as a Red on Red Fire Helmet.

Fire/EMS Lieutenant’s Role
The role of the Fire/EMS Lieutenant is to complete the role of a Staff member, being able to deal with complaints and be the first point of contact in the Fire Department Chain of Command. The Lieutenant will help with enforcing and bringing ideas for Policies and Procedures of the department as well as be a crucial role in the day-to-day operations by responding to calls and assisting the Scene Commander and, when needed to, take over Scene Command. The Lieutenant will be responsible for making sure fire personnel are following the rules and regulations within the department. They can be easily identified by having silver bugles as well as a Black on Red Fire Helmet.

APPARATUS AND STATIONS
Stations
Station 1

Rockford Hills - Los Santos SAFR Headquarters  (505 Rockford Dr)

Station 2

Paleto Bay - Blaine County SAFR Headquarters (3007 Paleto Blvd)

Station 3

Vespucci Beach Lifeguard Station (only used for small Vespucci patrols) (311 Bay City Ave)

Station 4

LSIA - International Airport House

Station 5

Sandy Shores House (1025 Alhambra Dr)

Station 6

Davis House (136 McDonald St)

Station 7

East Los Santos House (178 Capital Blvd)

Station Balancing
When staffing a station and there are more than 4 personnel on as Fire/EMS at one station, please attempt to staff other stations in the AOP so that resources can be spread throughout the county so that the server might run a little more smoothly. If the AOP is state-wide, when stations are able to be split, the next station that should be staffed shall be in the opposite county.

Civilian Interactions
The San Andreas Fire Rescue department currently does not provide Civilian Ride-alongs in apparatus.  However, on-duty personnel can still provide station tours and showcases inside the station for interested civilians.

Apparatus
Radio Identifiers (TS Names) can be the full name with apparatus number or the abbreviated version (shown in brackets):

110-F *Brush 20* or 110-F *BRSH20*

Brush (FIRE)

Callsign: BRUSH ## [BRSH##]

Is a wildland firefighting apparatus with basic rescue equipment. It can be operated by any firefighter.

Extras:
Extra #1: Front Windshield Wigwags [Required]
Extra #2: Bay Doors - Left [Allowed]
Extra #3: Bay Doors - Right [Allowed]
Extra #4: MDT/MDC [Required]
Extra #5: Running Boards [Required]

Medic (FIRE2)

Callsign: MEDIC ## [MED##]

Is a medical response unit that operates either in a BLS or an ALS capacity.

Extras:
Extra #1: Lightbar  [Banned]
Extra #2: Ram Bar [Allowed]
Extra #3: Ram Bar Extension [Allowed]
Extra #4: Extra Box Lights [Allowed]
Extra #5: Highbeam [Allowed] (Can be moved with NumPads “8” & “5”)
Extra #6: Bullhorns [Allowed]
Extra #7: Kussmaul Plug [Allowed in-quarters only]
Extra #8: Box Interior Lights [Allowed]
Extra #9: Left Bay Doors Open [Allowed]
Extra #10: Left Bay Doors Closed [Allowed]
Extra #11: Left & Right Scene Lights [Allowed]
Extra #12: Rear Scene Lights [Allowed]

EMS Fly (FIRE3)

Callsign: [FLY##]

Used by ALS qualified personnel to respond to medical calls requiring ALS assistance. (only to be used if there is a fully staffed medic [i.e. 2 people on the medic]).

Extras:
Extra #1: Lightbar [Required]
Extra #2: Ram Bar [Required]
Extra #3: Ram Bar Extension [Required]
Extra #4: Front Windshield Wigwags [Recommended]
Extra #5: Visor Lightbar [Banned]
Extra #6: Extra Grill Lights [Required]
Extra #7: Turnout Gear [Required]
Extra #8: Spotlight [Allowed] (Can be moved with NumPads “8” & “5”)
Extra #9: Spotlight folded [Allowed]
Extra #10: Cellular & A/V Antennas [Required]
Extra #11: Command Light [Banned]
Extra #12: Radio Antennas [Required]

Rescue (FIRE4)

Callsign Rescue ## [RESC##]

A vehicle used for incidents in which there is equipment needed that other fire apparatus may not carry (i.e High-Angle Rescue, Heavy rescues, etc...). It also has equipment to mitigate a hazmat incident.  This vehicle should not be sitting out idle and should only be brought out when needed. 

Extras:
Extra #1 - #6: Roll-up Doors - Left & Right [Allowed]
Extra #8: Front Scene Lights [Allowed]
Extra #9: Left Scene Lights [Allowed]
Extra #10: Right Scene Lights [Allowed]
Engine (FIRE5)

Callsign: ENGINE ## [ENG##]

Is a firefighting apparatus with basic rescue equipment as well as a water tank and hoses.  Can be operated by any firefighter.

Extras:
Extra #1: Bumper Box Closed [Allowed]
Extra #2: Bumper Box Open [Allowed]
Extra #3 - #5: Roll-up Doors - Left & Right [Allowed]
Extra #6: Roll-up Door - Rear [Allowed]
Extra #8: Front Scene Lights [Allowed]
Extra #9: Left Scene Lights [Allowed]
Extra #10: Right Scene Lights [Allowed]

Ladder (FIRE6), (FIRE7 on-scene)

Callsign: LADDER ## [LDR##]

Is a firefighting apparatus with an extending ladder to be used for elevation rescues, extrication, and technical rescues as well as used in ventilation if needed. This apparatus is not to be spawned in and sitting out only spawn in if needed.

Extras:
Extra #1: Stowed Ladder [Allowed]
Extra #2: Stowed Outriggers [Allowed]
Extra #3: Extended Outriggers [Allowed]
Extra #4: Ladder - Mid Straight Left [Allowed]
Extra #5: Ladder - Low Front Left [Allowed]
Extra #6: Ladder - Low Straight Right [Allowed]
Extra #7: Ladder - High Front Right [Allowed]
Extra #8: Left Scene Lights [Allowed]
Extra #9: Right Scene Lights [Allowed]
Extra #10: Roll-up Door - Rear [Allowed]
Extra #11 - #12: Roll-up Doors - Left [Allowed]

Command Silverado (FIRE8)

Callsign: BATTALION ## [BATT##]

This is the vehicle utilized by Fire CoC to respond to calls and take command. In LS County; it will be Battalion 10 and in Blaine County; it will be Battalion 20. The Battalion is issued to the highest-ranking member of CoC during patrol but can be passed down by approval of that highest-ranking staff to lower staff for them to run.

Extras:
Extra #1: Lightbar - Alternate Pattern [Allowed]
Extra #2: Black-out Rambar Lights [Allowed]
Extra #3: Black-out Traffic Advisor Lights [Allowed]
Extra #4: Wigwag Traffic Advisor Lights [Allowed]
Extra #6: Command Light [Allowed]
Extra #7: Front Scene Lights [Allowed]
Extra #8: Left Scene Lights [Allowed]
Extra #9: Right Scene Lights [Allowed]
Extra #10: Bed-cover Door Closed [Allowed]
Extra #11 - #12: Bed-cover Door Open [Allowed]

Gator (FIRE9)

Callsign: ROVER ##

[RVR##]

This is an off-road vehicle that is used on small trails that larger vehicles may not be able to drive down. If crewed by 1 person, this vehicle has the capability to transport a stable non-critical patient in the vehicle. The vehicle is roadworthy and is able to be used on local roads but not on highways. 

Extras:
Extra #1: Lightbar [Required]
Extra #2: Backboard [Required]
Extra #3: Ram Bar Lights [Required]
Extra #4: Animal Carrier [Banned]
Extra #5: Mechanical Tools [Required]
Extra #6: Bed Strap [Required]
Extra #7: Rear Scene Lights [Allowed]
Extra #8: Radio Antenna [Required]
Extra #9: Cellular Antenna [Required]

Otter (Boat), Nagasaki dinghy (1)

Callsign: OTTER ## [OTR##]

Utilized by rescue crews to perform water operations and water rescues

Extras:
Extra #1: Radio Extender [Required]
Extra #2: Seat Backs [Required]

Driving Procedures
Emergency Driving

All apparatus shall adhere to the rules of Defensive Driving:

Clearing Intersections:

When an apparatus is approaching a controlled intersection, they shall slow down to a rolling stop and only proceed when it is confirmed that there isn’t any traffic or all traffic has come to a stop.

Speed Limit:

All apparatus, with exception to the Fly Car, shall not exceed 80MPH on any paved roadway.  The Fly Car shall not exceed 100MPH on any paved roadway.  

On any dirt roads, speeds shall not exceed 40MPH with exception to Brush and the Fly Car.  The Brush and Fly Car shall not exceed 50MPH on any dirt roads.

 Arrive alive, don’t become another patient due to your driving.

While on the Ambulance with a loaded patient, the ambulance shall not exceed 80MPH. When you're transporting CODE 3 you shall not exceed 80 MPH. When going CODE 1, please be careful and obey the speed limits. Take corners slowly and keep in mind you have at least a patient, if not a co-worker in the box that you don’t want to be banged up by the time you get to the hospital.



CDL 

If you are driving a fire apparatus of 30,000 pounds or greater than you must have your Commercial driver's License. That means in order to drive the Engine and Ladder Truck; you must have your CDL.

Fly Car
Designation: Fly ##. The Fly Car is an ALS unit designed to offer ALS care by paramedics to scenes where there is: an ambulance already on-scene without a paramedic or to offer first responder assistance with an ambulance already on the way. They can also do intercepts with an ambulance carrying a BLS crew in order to offer ALS assistance on a call/transport. If the patient is in need of ALS care with a 2-manned EMT crew, then one of the EMTs may switch with the medic and FOLLOW the ambulance to the hospital while the medic is handling patient-care in the back of the ambulance. When responding in the fly car and the ambulance has a single EMT on it, then you are to leave the fly car on-scene and go with the patient and treat them en-route to the hospital. It should only be used if absolutely needed. If there are multiple victims needing priority transport; you are to take another ambulance rather than take the fly car. For those ALS-trained AirMed personnel, you can respond to a call for Medflight in the Fly Car. The fly car cannot be sitting out, it must be spawned when needed.

MED-FLIGHT
Med-Flight is a part of ASU and you must be ALS Certified to pilot and co-pilot the aircraft.  A Paramedic that isn't trained for Med-Flight is allowed to be a flight medic with you if the craft has 2 trained personnel already onboard.  If you're wanting to be Med-Flight, you will go on as primary Fire and then put MF behind your name (Ex: 708-F Stn 4 MF) so Fire Comm or Dispatch can contact if Med-Flight is needed to which you would respond in the fly-car down to the helipad meetup. Med-Flight's main base of operation is at LSIA. Refer to the ASU SOP for any questions and a full rundown of rules and regulations.

OPERATIONS
Radio Operations
Radio Operations consist of everything transmitted over the radio from when calling in service as your apparatus until you call out of service as the apparatus. We do not use 10 codes whatsoever only plain english. When going in service at the start of your shift you are to state which station you are at and what apparatus you will be using. Ex. “708 Foxtrot in service station 5” it’s up to you if you would like to specify what particular apparatus you are running out of that station.   There are many reasons that you would have to call over the radio to dispatchers. Some of these include, but are not limited to:

"Apparatus” in service

“Apparatus” responding

“Apparatus” on scene (sizeup if possible)

“Apparatus” establishing/terminating scene command

“Apparatus” transporting patient to hospital

“Apparatus” going out of service

Whenever calling into dispatch, you are to use your apparatus number and not your badge number. The apparatus number is the same as your station number just with a 0 so if you are at station 2 you are engine 20 and if you require another apparatus of the same type from that station then you are to use 1-9 instead of 0 so you need another engine from station 2 it’s engine 21.  Your badge number can only be used to call into dispatch when going in service or if dispatch requests a badge number of a certain unit. Your teamspeak identifier will be F as in Foxtrot when going on duty. If you wish to run medic and not a fire apparatus make sure you let dispatch know that you are in service as a medic apparatus and not a fire apparatus. If dispatch attempts to dispatch you as a fire apparatus and there is only 1 person available at the station and that person doesn’t wish to run a Fire truck simply call that fire truck out of service.  If you are riding with more than one person on the apparatus when you call in route let dispatch know who is on the apparatus on the call.

***Note, Firefighters are not allowed to use the NCIC /or Vehicle  to look up any of their own characters /or Vehicle. This is a logged action and any characters that are looked up this way will receive a warrant for Title 15 Section 6 of the penal code (Unauthorized Use of Computer, Cable, or Telecom Property).***

All firefighters/medics can not respond to any tweets or any text from anyone. We only responded to 911 calls, witnessed emergencies (seeing an MVA, etc.), or LEO request
Scene Size Up
Scene size up is the initial evaluation of an incident, in particular an immediate evaluation of hazards to responders, other lives, and property, and what additional resources may be needed. The first arriving unit should paint a picture of the scene to any other responding units and provide the Dispatcher with as much information possible about the current incident (further information is located in the fire cheat sheet)

Incident Command System (ICS)
The Incident Command System (ICS) is an organization system used on any emergency scene in order to distribute resources to work on multiple jobs at once and to separate responsibilities between all units on-scene. When arriving on-scene, The first unit on-scene performs a size up and takes command, and remains as command until on-duty command staff in another apparatus arrives on-scene or when the Command vehicle arrives on-scene; they will take command. Ex: “Engine 50 on-scene of a 2-story residential structure with flames showing from the roof. Engine 50 will have Panorama Command”.

Boat Operations 
It may occur that there is a potential for Fire and EMS to use a boat to reach injured persons in that are out to sea or in the middle of a lake not easily accessible from the shore. It is at this point that we can deploy the Otter. Which can be distinguished by the Nagasaki Dinghy 4-Seater in a red color. It is our job to coordinate with Port Authority units in case there is a need for search and rescue operations or recovery with a diver. In all operations that involve a seaborn vessel, FD personnel must wear a personal flotation device at all times. If there is a need to transport a patient to shore to an awaiting ambulance the otter can do so at the discretion of the medic on scene and stability of the patient. If the otter is going to be used to transport a patient to an awaiting ambulance it is up to the driver to take into consideration the patient when determining speed and roughness of seas.  

Motor Vehicle Accidents
When on the scene of a motor vehicle accident if you arrive in a fire truck at minimum you are to have your bunker pants, helmet and traffic vest. During the winter months when it’s snowing you can wear your station jacket and bunker pants with the helmet as well. If you respond on the ambulance at a minimum you are to have your traffic vest and helmet on. During the long sleeve months the Traffic vest will not work with our current station jacket so you can wear your helmet with your station uniform, also during the snow months you do have the option to wear your bunker gear while on scene of the mva. If you are actively involved in extrication or fire attack then you are to have your full PPE on.  

Motor Vehicle accidents are one of the most dangerous scenes that you can be on. The way that you make the area at least somewhat safer is the way how you park your apparatus. Ideally there should be a minimum of 2 fire apparatus and 1 ambulance responding to any MVA, but do to some in game restraints you may only get 1 firetruck and 1 ambulance. The correct way to park your vehicle on a traffic accident is at a 45 degree angle, taking up the initial lane of the accident plus 1.  The ambulance should be parked downstream of the incident where the back is facing the incident. 

Interpersonal Relationships

This policy outlines guidelines on employees who are in relationships;

When on duty, personnel actively in a relationship shall be professional at all times on shift.
Personnel in a relationship/family cannot ride on the same apparatus
Personnel in a relationship/family cannot be at the same station.
Personnel in a relationship may not be in the locker room at the same time. 
Personnel in a relationship/showing signs of getting in a relationship are to follow the above guidelines.


Personnel caught in violation of this will be sent off-duty and their character will be suspended. Continuous violations of this policy will result in all Fire Department Certifications to be taken away.

CARE
EMT Basic
As an EMT Basic you are allowed to do Basic Level of Care. What this means is that you are allowed to do things such as bandage and splint, take vitals and hook the patient up to the monitor, as well as work an AED. You treat the patient to the point to which they are stable and take them to a hospital for treatment. You cannot do any advanced procedures or give advanced medication without a Paramedic’s assistance. See the cheat sheet for any help needed 

Paramedics
As a Paramedic you are able to use medications and advanced procedures to help a patient get better or help them long enough to get them to a hospital to doctors. Medics are professionals that begin treatment for so that the patient can get to the hospital. As a paramedic you can run the fly car and as TEMs; if trained and it is required.



Paramedic Promotion

Emergency Medical Technicians (EMTs) have to show their capability and willingness to learn while on-duty as a BLS EMT to get recommended for specialized training to become an ALS Paramedic.  These recommendations shall come from Fire CoC and once chosen, the EMT will be notified and can then sign up for an ALS training.

What we look for in a Paramedic:

Activity: We want to see that you want to run fire by either going as a volunteer when needed or running it out of a station. 
Experience: Whether it be IRL or in-game knowledge, experience is big when it comes to being a paramedic and knowing what to do. 
 Attitude: Having a good attitude is everything when running as an FD unit, wanting to help others as well as wanting to further yourself as well.
Patient Care: Combining experience and attitude, how you treat patients and treat their injuries physically and mentally with bedside manners.


***NOTE: This promotion can be barred by the member having a minor or major point against them.  Once these points drop off, the EMT will be informed and are able to sign-up for ALS trainings.

Patient Refusal 
A patient at any point can refuse treatment if they are alert and oriented and are able to make sound decisions and are not impared. Depending on the patient’s presentation and complaint it is the job of you the Medic or EMT to give your best advice to the patient. This means if a patient does refuse you are required to get paperwork showing they do not want to go to the hospital against your advice.   

Hospitals and Trauma levels 
List of all the hospitals and their trauma level I (1) being highest and level IV (4) lowest. Only transport patients to hospitals inside the county Area of Patrol (AOP). Please take note of your location on the map, if a patient is critical that they need IMMEDIATE attention at a hospital then take them to the closest hospital.  Hospitals are better equipped to stabilize the patient and then transport to a farther hospital.

Level I: Typically a teaching hospital and a major trauma center, Usually take things that are serious and life threatening here. Will have all doctors needed to handle anything on call.  

Level II: Can do the same things as a Level one but isn’t a teaching hospital. Most likely will not have a psych ward or neurological doctor on call.   

Level III: can take basic life threatening calls that are urgent and need to be taken right then and there. 

Level IV: Can’t handle serious life threatening calls usually more for non life threatening like a broken limb. (Like a clinic.)

Name

County

Trauma Level

Mount Zonah Medical Center (507 Dorset Dr)

Los Santos

I (One)

Central Los Santos Medical Center (149 Crusade Rd)

Los Santos

I (One)

The Bay Care Center (Paleto Bay Medical Center) (3015 Paleto Blvd)

Blaine

III (Three)

Sandy Shores Medical Center (1029 Alhambra Dr)

Blaine

IV (Four)

Pillbox Hill Medical Center (201 Elgin Ave)

Los Santos

II (Two)



In Los Santos County

Mount Zonah and Central are your options for level 1 Trauma if necessary but when you are in the city Pillbox can also take serious trauma as a level 2, so if you need to get to the hospital and you are in the NE side of the city Pillbox will be your best bet. St. Fiacre is a women’s facility and if the patient wants to go there you can take them they have the ability to deal with most non life threatening medical issues. 

In Blaine County

When Paleto Medical center is staffed by medical personnel that should be your main hospital of transport for all patients they are essentially the “trauma hospital” for the county. If you have a patient that is close to Sandy Shores and needs to be transported immediately to some kind of trauma hospital, you can take them to Sandy Shores for county air transport to another facility.

Transporting to the Hospital 
There are only 2 codes you should be going to the hospital and that is Code 1 (no lights) and Code 3 (lights and sirens). When you use these depends on the patient's status. 

Code 1 Response: This response should be used when the patient is in stable condition and there is no threat to the patient’s condition degrading. So you can take time to go to the hospital.

Code 3 Response: This response should be used when there is an immediate threat to a patient's life and they need to be in an ER or on an operating table within the next 20-25 min or they will die. Or there is a potential that the patient may degrade.

Calling the Hospitals

When transporting someone to Paleto Bay/Pillbox Hill when the hospital is staffed please, if you are able to, call in a patient report to the hospital letting them know you are on your way. This gives them time to prepare equipment and necessary tools needed for that specific patient. 

The report goes 

You identify yourself and Apparatus # 
Give the Patient age and chief complaint (why they are going to the hospital) 
Give their vitals 
Give info of what you have done to that point 
Ask if there is any questions and answer any questions accordingly 
Medical Care in a Crime Scene

When found in a position of providing care after a criminal act has occurred, be sure to preserve as much evidence as possible.  What this means:

1). If a patient appears to be dead on-scene (DOS), check vitals and nature of injuries; if their injuries aren't conducive to life and they don't have any life signs, leave them be.

2). If a patient is shot or stabbed, cut the clothing in a way to avoid the holes made by the weapon to get access to the working area.

3). Do not touch anything that isn't necessary to care for the patient.

4). Do not walk through fluids unless necessary to get to a patient.

5). Any one-use items you used on a patient that becomes DOS should be left with them and not removed.

Patients in Custody

If a patient is in custody or you may suspect that LEOs may need to talk to them, let them know where you are taking them if they do not ask. If the patient is a minor and in Law Enforcement custody, it is up to the LEOs if they want them transported. If a suspect needs to be transported to the hospital, confirm with LEOs on-scene that they are aware the suspect is being transported and see if there is someone available to follow the ambulance to the hospital with the suspect.  If no officers are able to follow, get a unit number of an officer that will be staying on-scene and, if priority traffic isn’t in-effect, advise that specific unit when you have dropped the patient off at the hospital.

Scene of Violence
Staging

When an EMS or Fire unit is called to stage prior to moving into an active leo scene if able able the units should stage a minimum of 2 blocks and around the corner 90 degrees from the incident.

Self-Defense

If you find yourself in an active scene of violence: 

RUN and escape if possible:

Alert Fire Control to the situation as soon as you’re safe.
Leave any unnecessary equipment behind.
Help others escape, if possible, but evacuate even if others don’t decide to follow you.
Until Law Enforcement arrives, alert other people in the area and try to coordinate everyone to a safe evacuation point.
HIDE if escape is not possible:

Get out of the threat’s view and stay quiet.
Silence all electronics including radio if not wearing an earpiece (If wearing earpiece, reduce volume as much as possible).
Lock and block doors, close blinds, and turn off lights.
Don’t hide in groups.  Spread out along walls or hide separately.
If safe to do so, inform Fire Control of all important information (Location of threat/suspect, type of threat, number of suspects, suspect’s description).
Stay in place until Law Enforcement Officers advise Code 4.
FIGHT as an absolute last resort:

Commit to fighting and act as aggressive as possible against the threat.
For All Tiers, do not use weapons, go hands-on and attempt to control the suspect by overpowering them.
If, while actively running Fire/EMS, you receive a verbal or physical threat then you are to immediately contact LEO and do what is best to get safe.

-Verbal Threat: If the Person is being transported, take them to the Hospital and have LEO ready to arrest them for Criminal Threats. If you are on scene and someone verbally threatens you contact, LEO and get to a safe location away from the person.

-Physical Threats: If someone is physically threatening you, you are to follow the above guidelines for self defense. If you are transporting this person then you should contact LEO and tell them what is happening, coordinate a way for them to get the suspect and for you to get to safety, and then follow that plan (EX. LEO responds to your location and surrounds the medic and makes the situation safe.)



Taser barb removal 

Any fire apparatus can respond to a taser barb removal and when a call comes in you are to respond code 1 to the scene. If law enforcement on scene indicates a life threatening situation involved with the patient they can let you know to step it up or not. 

Procedure for removal is…

Hold skin around barb 
Swiftly pull it out, if bleeding use 4x4 to clean, and
Place bandaid over affected area


